In [4]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame([[1,2,3], [4,5,6],[7,8,9], [10,11,12]], columns=["A","B","C"], index=['x','y','z','zz'])

In [6]:
df.head()

     A   B   C
x    1   2   3
y    4   5   6
z    7   8   9
zz  10  11  12

In [7]:
df.tail(3)

     A   B   C
y    4   5   6
z    7   8   9
zz  10  11  12

In [8]:
df.describe()

               A          B          C
count   4.000000   4.000000   4.000000
mean    5.500000   6.500000   7.500000
std     3.872983   3.872983   3.872983
min     1.000000   2.000000   3.000000
25%     3.250000   4.250000   5.250000
50%     5.500000   6.500000   7.500000
75%     7.750000   8.750000   9.750000
max    10.000000  11.000000  12.000000

In [9]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [10]:
df.index

Index(['x', 'y', 'z', 'zz'], dtype='object')

In [11]:
df.nunique()

A    4
B    4
C    4
dtype: int64

In [8]:
#Loading Data from data frames
coffee = pd.read_csv('./warmup-data/coffee.csv')

In [9]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [10]:
coffee.describe()

       Units Sold
count   14.000000
mean    32.857143
std      9.346798
min     15.000000
25%     26.250000
50%     35.000000
75%     38.750000
max     45.000000

In [11]:
coffee.tail()

         Day Coffee Type  Units Sold
9     Friday       Latte          35
10  Saturday    Espresso          45
11  Saturday       Latte          35
12    Sunday    Espresso          45
13    Sunday       Latte          35

In [16]:
coffee.loc()

In [30]:
#view sample of rows , make it deterministic i.e repeatable
coffee.sample(14, random_state=1)

          Day Coffee Type  Units Sold
3     Tuesday       Latte          20
7    Thursday       Latte          30
6    Thursday    Espresso          40
2     Tuesday    Espresso          30
10   Saturday    Espresso          45
4   Wednesday    Espresso          35
1      Monday       Latte          15
12     Sunday    Espresso          45
0      Monday    Espresso          25
13     Sunday       Latte          35
9      Friday       Latte          35
8      Friday    Espresso          45
11   Saturday       Latte          35
5   Wednesday       Latte          25

In [20]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [34]:
#Filter data frame by rows and columns
coffee.loc[[0,1,2]]

       Day Coffee Type  Units Sold
0   Monday    Espresso          25
1   Monday       Latte          15
2  Tuesday    Espresso          30

In [40]:
#Slice data from one index to another
coffee.loc[0:14]

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [ ]:
coffee.loc[5:8,["Day", "Units Sold" ,] ]

         Day  Units Sold
5  Wednesday          25
6   Thursday          40
7   Thursday          30
8     Friday          45

In [57]:
coffee[coffee["Coffee Type"] == "Latte"].loc[5:9]

         Day Coffee Type  Units Sold
5  Wednesday       Latte          25
7   Thursday       Latte          30
9     Friday       Latte          35

In [70]:
#Filter using index location
coffee[coffee["Coffee Type"] == "Latte"].iloc[0:10]

          Day Coffee Type  Units Sold
1      Monday       Latte          15
3     Tuesday       Latte          20
5   Wednesday       Latte          25
7    Thursday       Latte          30
9      Friday       Latte          35
11   Saturday       Latte          35
13     Sunday       Latte          35